.docker/artillery/script.yaml
config:
  target: 'http://app:3000'
  phases:
    - duration: 120
      arrivalRate: 2000
scenarios:
  - name: 'Create course!'
    flow:
      - post:
          url: '/courses'
          json:
            name: 'Course {{ $randomNumber(1,10000) }}'
            slug: 'some-course-{{ $randomString() }}'
            meta:
              'miaou-{{ $randomString() }}': 'Cat {{ $randomString() }}'
              '{{ $randomNumber(1,10000) }}': {{ $randomNumber(1,10000) }}
          expect:
            - statusCode: 201
  - name: 'Get courses'
    flow:
      - get:
          url: '/courses'
          expect:
            - statusCode: 200
  - name: 'Check health'
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200
  - name: 'Permanent redirect'
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 301