.docker/artillery/script.yaml
config:
  target: "http://app:3000"
  phases:
    - duration: 120
      arrivalRate: 2000
scenarios:
  - name: "Create course!"
    flow:
      - post:
          url: "/api/courses"
          json:
            name: "Course {{ $randomNumber(1,10000) }}"
            description: "Some course {{ $randomNumber(1,10000) }} long description"
            slug: "some-course-{{ $randomString() }}"
            meta:
              "miaou-{{ $randomString() }}": "Cat {{ $randomString() }}"
              "{{ $randomNumber(1,10000) }}": "{{ $randomNumber(1, 10000) }}"
          expect:
            - statusCode: 201
  - name: "Get courses"
    flow:
      - get:
          url: "/api/courses"
          expect:
            - statusCode: 200
  - name: "Get activities"
    flow:
      - get:
          url: "/api/activities"
          expect:
            - statusCode: 200
  - name: "Get comments"
    flow:
      - get:
          url: "/api/comments"
          expect:
            - statusCode: 200
  - name: "Get modules"
    flow:
      - get:
          url: "/api/modules"
          expect:
            - statusCode: 200
  - name: "Get assignments"
    flow:
      - get:
          url: "/api/assignments"
          expect:
            - statusCode: 200
  - name: "Check health"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
  - name: "Permanent redirect"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 308